Revit 2018 API
EnergyDataSettings.MassZoneCoreOffset Property
 It defines the default behavior for the automatic generation of Mass Zones for each Mass Floor in the Project. Specifying a value here will offset the outside perimeter of a Mass Zone to create the core.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2011
Syntax
C#
[ObsoleteAttribute("This property is obsolete and will be removed in a future version of Revit. Use CoreOffset instead.")]
public double MassZoneCoreOffset { get; set; }
Visual Basic
<ObsoleteAttribute("This property is obsolete and will be removed in a future version of Revit. Use CoreOffset instead.")> _
Public Property MassZoneCoreOffset As Double
	Get
	Set
Visual C++
[ObsoleteAttribute(L"This property is obsolete and will be removed in a future version of Revit. Use CoreOffset instead.")]
public:
property double MassZoneCoreOffset {
	double get ();
	void set (double value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The mass zone core offset is less than zero.
See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace